V6/online/CAAWSCommon/xml/EncryptedAndSignedSOAPRequest.xml

<?xml version="1.0" encoding="utf-8" ?>

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <s:Header>
        <o:Security xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" s:mustUnderstand="1">
            <u:Timestamp u:Id="uuid-a2c7af82-6d39-4390-8bf4-59bb5c71e1da-1">
                <u:Created>2007-10-05T13:59:19.798Z</u:Created>
                <u:Expires>2007-10-05T14:04:19.798Z</u:Expires>
            </u:Timestamp>
            <o:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" u:Id="uuid-f30b6e4c-a53a-4142-b063-9aa59d7522a6-2">MIICSjCCAbOgAwIBAgIBEjANBgkqhkiG9w0BAQUFADArMQwwCgYDVQQKEwNjYTMxDDAKBgNVBAsTA3NlYzENMAsGA1UEAxMEbXljYTAeFw0wNzA5MjExOTA0MjdaFw0wODA5MjAxOTA0MjdaMC4xDTALBgNVBAoTBG15Y28xDTALBgNVBAsTBG15b3UxDjAMBgNVBAMTBWFsaWNlMIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQCQn2EigX5n9nL/oCwPDNtq8mAsnwC4FeBK5jWMbyfd1j0FAuIjMp0gcQ1drQPj9lm252Upf27Gfzco763hMvGzdocO7yGWHIk+KX4fC5GfnRBXwfB5oS6k/D6rKp2avrz5WeLsG118INttaVibiQvmUhHnzdUWFRB56IsOBSbmiwIDAQABo3sweTAJBgNVHRMEAjAAMCwGCWCGSAGG+EIBDQQfFh1PcGVuU1NMIEdlbmVyYXRlZCBDZXJ0aWZpY2F0ZTAdBgNVHQ4EFgQUM/CzhbaaKLYpQjzgmFSMwX5ILFMwHwYDVR0jBBgwFoAUAQB/1l88r1HCu3ZR4OZo3uw/QeowDQYJKoZIhvcNAQEFBQADgYEAcCp752SZ8rCKzZo+YIgIN7iRc+I7VVlbK5aReqt0wgt47GVAzC4mJu8SJkqgaJRPedQwT+slMXgeYmA7f090QATV/7rLrr19+3tRcdOORAPETe2e2bvCTSO4XmVikMW1wjH0iatqGy/Hj7+bVRsxRwAZcHniHpTcape9EeissUA=</o:BinarySecurityToken>
            <e:EncryptedKey xmlns:e="http://www.w3.org/2001/04/xmlenc#" Id="_0">
                <e:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/>
                <KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#">
                    <o:SecurityTokenReference>
                        <o:KeyIdentifier EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509SubjectKeyIdentifier">UArxwgZVbnOMj9umUpSiYqQmlCY=</o:KeyIdentifier>
                    </o:SecurityTokenReference>
                </KeyInfo>
                <e:CipherData>
                    <e:CipherValue>IA2TcLIdVYaTSITfAfqs7VMvC+pX/TCOR8RH/MqpirMBVX0M6IIwc8M0T+acSeN9p75hnU46YNqmZoK1W4sBrCUJ8BhLDEg5wp060QivY+9+XObgabcZEngUJcVCzhTBgzABdcoEfYdGPBxnf7sqsCpxQXvsv61Ei6OHRyxiCYE=</e:CipherValue>
                </e:CipherData>
                <e:ReferenceList>
                    <e:DataReference URI="#_2"/>
                </e:ReferenceList>
            </e:EncryptedKey>
            <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
                <SignedInfo>
                    <CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                    <SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
                    <Reference URI="#_1">
                        <Transforms>
                            <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        </Transforms>
                        <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <DigestValue>NrNuaEGyy0kngRC0WVLq3jZrufw=</DigestValue>
                    </Reference>
                    <Reference URI="#uuid-a2c7af82-6d39-4390-8bf4-59bb5c71e1da-1">
                        <Transforms>
                            <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        </Transforms>
                        <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <DigestValue>4akh78XM0cs87RZ+NX5zW4VgAfk=</DigestValue>
                    </Reference>
                </SignedInfo>
                <SignatureValue>VB1gJut3NDBIZ36i+5kIc7VtMX354c+CfMwKApWlABQeCx0TT40nKo8AyqyH3K4+8NrsocJkMYxHao2X8c9XKyy7N4lovikyXnsY+wYj7bKOT/IF2huX1B9zUnHZhVy3Pa+i0ni93p2Nh2Ln0KTheEhI7f/5k3gqzBy3cqhESCk=</SignatureValue>
                <KeyInfo>
                    <o:SecurityTokenReference>
                        <o:Reference URI="#uuid-f30b6e4c-a53a-4142-b063-9aa59d7522a6-2" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/>
                    </o:SecurityTokenReference>
                </KeyInfo>
            </Signature>
        </o:Security>
    </s:Header>
    <s:Body xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" u:Id="_1">
        <e:EncryptedData xmlns:e="http://www.w3.org/2001/04/xmlenc#" Id="_2" Type="http://www.w3.org/2001/04/xmlenc#Content">
            <e:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc"/>
            <e:CipherData>
                <e:CipherValue>A6OEmJO2IQ3wzwvj/PEzAAWciDMq6oQ6Br/IQl3DB+Afv0vt9G2pPyaTRX2gTu+psu6tlnK/L1bXY2TF2gYq1CwoNxL7ZtNEomGHcGBbyrjEmInizT+dQIoA0kHrhtycqxYKmTOkOpnBHSJKwziemP1ZQjQ7yOPc8pBzYFRZneewxcwzV0kjvC9YJKvRmTCeg6xYZoX5uPkxG09CGhnIxAtOGZG/Df/JWok59RfmK1f8Rd3i7Rpf66D+sumonJ3MfHwM8nUTJmtGFrR6ApLhmJwtJuDjeKysJ+P7q9s71BDaxtqsVpSSo/rQ4TfLXrJczyWyN0TvsykwBWjB+auN36LQaohgKdTa0L+UhXCUGXM=</e:CipherValue>
            </e:CipherData>
        </e:EncryptedData>
    </s:Body>
</s:Envelope>
